rost0031/STM32491_CPLR/Firmware/Common/bsp/sdram/sdram.c
/**
 * @file    sdram.c
 * @brief   Basic driver for MT48LC2M3B2B5-7E SDRAM memory on the FMC bus on the
 * STM324x9I-EVAL board.
 *
 * @date    09/24/2014
 * @author  Harry Rostovtsev
 * @email   harry_rostovtsev@datacard.com
 * Copyright (C) 2014 Datacard. All rights reserved.
 *
 * @addtogroup groupSDRAM
 * @{
 */

/* Includes ------------------------------------------------------------------*/
#include "sdram.h"
#include "qp_port.h"                                        /* for QP support */
#include "stm32f4xx_it.h"
#include "project_includes.h"
#include "Shared.h"
#include "stm32f4xx_fmc.h"                         /* For STM32F4 FMC support */
#include "stm32f4xx_rcc.h"                         /* For STM32F4 RCC support */
#include "stm32f4xx_gpio.h"                       /* For STM32F4 GPIO support */

/* Compile-time called macros ------------------------------------------------*/
Q_DEFINE_THIS_FILE                  /* For QSPY to know the name of this file */
DBG_DEFINE_THIS_MODULE( DC3_DBG_MODL_SDRAM ); /* For dbg system to ID this module */

/* Private typedefs ----------------------------------------------------------*/
/* Private defines -----------------------------------------------------------*/

/**
  * @brief  FMC SDRAM Mode definition register defines
  */
#define SDRAM_MODEREG_BURST_LENGTH_1             ((uint16_t)0x0000)
#define SDRAM_MODEREG_BURST_LENGTH_2             ((uint16_t)0x0001)
#define SDRAM_MODEREG_BURST_LENGTH_4             ((uint16_t)0x0002)
#define SDRAM_MODEREG_BURST_LENGTH_8             ((uint16_t)0x0004)
#define SDRAM_MODEREG_BURST_TYPE_SEQUENTIAL      ((uint16_t)0x0000)
#define SDRAM_MODEREG_BURST_TYPE_INTERLEAVED     ((uint16_t)0x0008)
#define SDRAM_MODEREG_CAS_LATENCY_2              ((uint16_t)0x0020)
#define SDRAM_MODEREG_CAS_LATENCY_3              ((uint16_t)0x0030)
#define SDRAM_MODEREG_OPERATING_MODE_STANDARD    ((uint16_t)0x0000)
#define SDRAM_MODEREG_WRITEBURST_MODE_PROGRAMMED ((uint16_t)0x0000)
#define SDRAM_MODEREG_WRITEBURST_MODE_SINGLE     ((uint16_t)0x0200)

/* Private macros ------------------------------------------------------------*/
/* Private variables and Local objects ---------------------------------------*/
/**
 * @brief   A large buffer in SDRAM for testing.
 */
__attribute__((section(".sdram"))) uint32_t sdRamTestBuffer[10000];

/* Private function prototypes -----------------------------------------------*/
static void SDRAM_slowPrintMemRegion( uint32_t startAddr, uint32_t nBytes );
/* Private functions ---------------------------------------------------------*/

/******************************************************************************/
void SDRAM_Init( void )
{
   /* GPIO configuration for FMC SDRAM bank */
   SDRAM_GPIOInit();

   /* Enable FMC clock */
   RCC_AHB3PeriphClockCmd( RCC_AHB3Periph_FMC, ENABLE );

   /* FMC Configuration ------------------------------------------------------*/
   FMC_SDRAMInitTypeDef        FMC_SDRAMInitStructure;
   FMC_SDRAMTimingInitTypeDef  FMC_SDRAMTimingInitStructure;
   /* FMC SDRAM Bank configuration */
   /* Timing configuration for 90 Mhz of SD clock frequency (180Mhz/2) */
   /* TMRD: 2 Clock cycles */
   FMC_SDRAMTimingInitStructure.FMC_LoadToActiveDelay    = 2;
   /* TXSR: min=70ns (7x11.11ns) */
   FMC_SDRAMTimingInitStructure.FMC_ExitSelfRefreshDelay = 7;
   /* TRAS: min=42ns (4x11.11ns) max=120k (ns) */
   FMC_SDRAMTimingInitStructure.FMC_SelfRefreshTime      = 4;
   /* TRC:  min=70 (7x11.11ns) */
   FMC_SDRAMTimingInitStructure.FMC_RowCycleDelay        = 7;
   /* TWR:  min=1+ 7ns (1+1x11.11ns) */
   FMC_SDRAMTimingInitStructure.FMC_WriteRecoveryTime    = 2;
   /* TRP:  20ns => 2x11.11ns */
   FMC_SDRAMTimingInitStructure.FMC_RPDelay              = 2;
   /* TRCD: 20ns => 2x11.11ns */
   FMC_SDRAMTimingInitStructure.FMC_RCDDelay             = 2;

   /* FMC SDRAM control configuration */
   FMC_SDRAMInitStructure.FMC_Bank               = FMC_Bank1_SDRAM;
   /* Row addressing: [7:0] */
   FMC_SDRAMInitStructure.FMC_ColumnBitsNumber   = FMC_ColumnBits_Number_8b;
   /* Column addressing: [10:0] */
   FMC_SDRAMInitStructure.FMC_RowBitsNumber      = FMC_RowBits_Number_11b;
   FMC_SDRAMInitStructure.FMC_SDMemoryDataWidth  = FMC_SDMemory_Width_32b;
   FMC_SDRAMInitStructure.FMC_InternalBankNumber = FMC_InternalBank_Number_4;
   /* CL: Cas Latency = 3 clock cycles */
   FMC_SDRAMInitStructure.FMC_CASLatency         = FMC_CAS_Latency_3;
   FMC_SDRAMInitStructure.FMC_WriteProtection    = FMC_Write_Protection_Disable;
   FMC_SDRAMInitStructure.FMC_SDClockPeriod      = FMC_SDClock_Period_2;
   FMC_SDRAMInitStructure.FMC_ReadBurst          = FMC_Read_Burst_Enable;
   FMC_SDRAMInitStructure.FMC_ReadPipeDelay      = FMC_ReadPipe_Delay_1;
   FMC_SDRAMInitStructure.FMC_SDRAMTimingStruct  = &FMC_SDRAMTimingInitStructure;

   /* FMC SDRAM bank initialization */
   FMC_SDRAMInit(&FMC_SDRAMInitStructure);

   /* FMC SDRAM device initialization sequence */
   SDRAM_InitSequence();
}

/******************************************************************************/
void SDRAM_GPIOInit(void)
{
   /* Enable GPIOs clock */
   RCC_AHB1PeriphClockCmd(
         RCC_AHB1Periph_GPIOC |
         RCC_AHB1Periph_GPIOD |
         RCC_AHB1Periph_GPIOE |
         RCC_AHB1Periph_GPIOF |
         RCC_AHB1Periph_GPIOG |
         RCC_AHB1Periph_GPIOH |
         RCC_AHB1Periph_GPIOI,
         ENABLE
   );

   /*-- GPIOs Configuration --------------------------------------------------*/
   /*
 +-------------------+------------------+------------------+-------------------+
 +                       SDRAM pins assignment                                 +
 +-------------------+------------------+------------------+-------------------+
 | PD0  <-> FMC_D2   | PE0  <-> FMC_NBL0| PF0  <-> FMC_A0  | PG0 <-> FMC_A10   |
 | PD1  <-> FMC_D3   | PE1  <-> FMC_NBL1| PF1  <-> FMC_A1  | PG1 <-> FMC_A11   |
 | PD8  <-> FMC_D13  | PE7  <-> FMC_D4  | PF2  <-> FMC_A2  | PG4 <-> FMC_A14   |
 | PD9  <-> FMC_D14  | PE8  <-> FMC_D5  | PF3  <-> FMC_A3  | PG5 <-> FMC_A15   |
 | PD10 <-> FMC_D15  | PE9  <-> FMC_D6  | PF4  <-> FMC_A4  | PG8 <-> FC_SDCLK  |
 | PD14 <-> FMC_D0   | PE10 <-> FMC_D7  | PF5  <-> FMC_A5  | PG15 <-> FMC_NCAS |
 | PD15 <-> FMC_D1   | PE11 <-> FMC_D8  | PF11 <-> FC_NRAS |-------------------+
 +-------------------| PE12 <-> FMC_D9  | PF12 <-> FMC_A6  |
                     | PE13 <-> FMC_D10 | PF13 <-> FMC_A7  |
                     | PE14 <-> FMC_D11 | PF14 <-> FMC_A8  |
                     | PE15 <-> FMC_D12 | PF15 <-> FMC_A9  |
 +-------------------+------------------+------------------+
 | PH2 <-> FMC_SDCKE0| PI4 <-> FMC_NBL2 |
 | PH3 <-> FMC_SDNE0 | PI5 <-> FMC_NBL3 |
 | PH5 <-> FMC_SDNW  |------------------+
 +-------------------+
 +-------------------+------------------+
 +   32-bits Mode: D31-D16              +
 +-------------------+------------------+
 | PH8 <-> FMC_D16   | PI0 <-> FMC_D24  |
 | PH9 <-> FMC_D17   | PI1 <-> FMC_D25  |
 | PH10 <-> FMC_D18  | PI2 <-> FMC_D26  |
 | PH11 <-> FMC_D19  | PI3 <-> FMC_D27  |
 | PH12 <-> FMC_D20  | PI6 <-> FMC_D28  |
 | PH13 <-> FMC_D21  | PI7 <-> FMC_D29  |
 | PH14 <-> FMC_D22  | PI9 <-> FMC_D30  |
 | PH15 <-> FMC_D23  | PI10 <-> FMC_D31 |
 +------------------+-------------------+

 +-------------------+
 +  Pins remapping   +
 +-------------------+
 | PC0 <-> FMC_SDNWE |
 | PC2 <-> FMC_SDNE0 |
 | PC3 <-> FMC_SDCKE0|
 +-------------------+
    */

   /* Common GPIO configuration */
   GPIO_InitTypeDef GPIO_InitStructure;
   GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;
   GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
   GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
   GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;

   /* GPIOD configuration */
   GPIO_PinAFConfig(GPIOD, GPIO_PinSource0, GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOD, GPIO_PinSource1, GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOD, GPIO_PinSource8, GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOD, GPIO_PinSource9, GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOD, GPIO_PinSource10, GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOD, GPIO_PinSource14, GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOD, GPIO_PinSource15, GPIO_AF_FMC);

