rost0031/STM32491_CPLR/Firmware/Common/bsp/sdram/sdram.c
   GPIO_InitStructure.GPIO_Pin =
         GPIO_Pin_0  |GPIO_Pin_1  |GPIO_Pin_8 | GPIO_Pin_9 |
         GPIO_Pin_10 |GPIO_Pin_14 |GPIO_Pin_15;

   GPIO_Init(GPIOD, &GPIO_InitStructure);

   /* GPIOE configuration */
   GPIO_PinAFConfig(GPIOE, GPIO_PinSource0 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOE, GPIO_PinSource1 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOE, GPIO_PinSource7 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOE, GPIO_PinSource8 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOE, GPIO_PinSource9 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOE, GPIO_PinSource10 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOE, GPIO_PinSource11 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOE, GPIO_PinSource12 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOE, GPIO_PinSource13 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOE, GPIO_PinSource14 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOE, GPIO_PinSource15 , GPIO_AF_FMC);

   GPIO_InitStructure.GPIO_Pin =
         GPIO_Pin_0  | GPIO_Pin_1  | GPIO_Pin_7  | GPIO_Pin_8  |
         GPIO_Pin_9  | GPIO_Pin_10 | GPIO_Pin_11 | GPIO_Pin_12 |
         GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;

   GPIO_Init(GPIOE, &GPIO_InitStructure);

   /* GPIOF configuration */
   GPIO_PinAFConfig(GPIOF, GPIO_PinSource0 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOF, GPIO_PinSource1 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOF, GPIO_PinSource2 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOF, GPIO_PinSource3 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOF, GPIO_PinSource4 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOF, GPIO_PinSource5 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOF, GPIO_PinSource11 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOF, GPIO_PinSource12 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOF, GPIO_PinSource13 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOF, GPIO_PinSource14 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOF, GPIO_PinSource15 , GPIO_AF_FMC);

   GPIO_InitStructure.GPIO_Pin =
         GPIO_Pin_0  | GPIO_Pin_1  | GPIO_Pin_2  | GPIO_Pin_3  |
         GPIO_Pin_4  | GPIO_Pin_5  | GPIO_Pin_11 | GPIO_Pin_12 |
         GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;

   GPIO_Init(GPIOF, &GPIO_InitStructure);

   /* GPIOG configuration */
   GPIO_PinAFConfig(GPIOG, GPIO_PinSource0 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOG, GPIO_PinSource1 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOG, GPIO_PinSource4 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOG, GPIO_PinSource5 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOG, GPIO_PinSource8 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOG, GPIO_PinSource15 , GPIO_AF_FMC);


   GPIO_InitStructure.GPIO_Pin =
         GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_4 |
         GPIO_Pin_5 | GPIO_Pin_8 | GPIO_Pin_15;

   GPIO_Init(GPIOG, &GPIO_InitStructure);

   /* GPIOH configuration */
   GPIO_PinAFConfig(GPIOH, GPIO_PinSource2 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOH, GPIO_PinSource3 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOH, GPIO_PinSource5 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOH, GPIO_PinSource8 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOH, GPIO_PinSource9 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOH, GPIO_PinSource10 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOH, GPIO_PinSource11 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOH, GPIO_PinSource12 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOH, GPIO_PinSource13 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOH, GPIO_PinSource14 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOH, GPIO_PinSource15 , GPIO_AF_FMC);


   GPIO_InitStructure.GPIO_Pin =
         GPIO_Pin_2  | GPIO_Pin_3  | GPIO_Pin_5  | GPIO_Pin_8  |
         GPIO_Pin_9  | GPIO_Pin_10 | GPIO_Pin_11 | GPIO_Pin_12 |
         GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;

   GPIO_Init(GPIOH, &GPIO_InitStructure);

   /* GPIOI configuration */
   GPIO_PinAFConfig(GPIOI, GPIO_PinSource0 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOI, GPIO_PinSource1 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOI, GPIO_PinSource2 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOI, GPIO_PinSource3 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOI, GPIO_PinSource4 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOI, GPIO_PinSource5 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOI, GPIO_PinSource6 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOI, GPIO_PinSource7 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOI, GPIO_PinSource9 , GPIO_AF_FMC);
   GPIO_PinAFConfig(GPIOI, GPIO_PinSource10 , GPIO_AF_FMC);

   GPIO_InitStructure.GPIO_Pin =
         GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 |
         GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 |
         GPIO_Pin_9 | GPIO_Pin_10;

   GPIO_Init(GPIOI, &GPIO_InitStructure);
}

/******************************************************************************/
void SDRAM_InitSequence( void )
{
   FMC_SDRAMCommandTypeDef FMC_SDRAMCommandStructure;
   uint32_t tmpr = 0;
   uint32_t timeout = SDRAM_TIMEOUT;

   /* Step 3 -----------------------------------------------------------------*/
   /* Configure a clock configuration enable command */
   FMC_SDRAMCommandStructure.FMC_CommandMode = FMC_Command_Mode_CLK_Enabled;
   FMC_SDRAMCommandStructure.FMC_CommandTarget = FMC_Command_Target_bank1;
   FMC_SDRAMCommandStructure.FMC_AutoRefreshNumber = 1;
   FMC_SDRAMCommandStructure.FMC_ModeRegisterDefinition = 0;
   /* Wait until the SDRAM controller is ready */
   while((FMC_GetFlagStatus(FMC_Bank1_SDRAM, FMC_FLAG_Busy) != RESET) && (timeout > 0))
   {
      timeout--;
   }
   /* Send the command */
   FMC_SDRAMCmdConfig(&FMC_SDRAMCommandStructure);

   /* Step 4 -----------------------------------------------------------------*/
   /* Insert 100 ms delay */
   BSP_Delay(10);

   /* Step 5 -----------------------------------------------------------------*/
   /* Configure a PALL (precharge all) command */
   FMC_SDRAMCommandStructure.FMC_CommandMode = FMC_Command_Mode_PALL;
   FMC_SDRAMCommandStructure.FMC_CommandTarget = FMC_Command_Target_bank1;
   FMC_SDRAMCommandStructure.FMC_AutoRefreshNumber = 1;
   FMC_SDRAMCommandStructure.FMC_ModeRegisterDefinition = 0;

   /* Wait until the SDRAM controller is ready */
   timeout = SDRAM_TIMEOUT;
   while((FMC_GetFlagStatus(FMC_Bank1_SDRAM, FMC_FLAG_Busy) != RESET) && (timeout > 0))
   {
      timeout--;
   }
   /* Send the command */
   FMC_SDRAMCmdConfig(&FMC_SDRAMCommandStructure);

   /* Step 6 -----------------------------------------------------------------*/
   /* Configure a Auto-Refresh command */
   FMC_SDRAMCommandStructure.FMC_CommandMode = FMC_Command_Mode_AutoRefresh;
   FMC_SDRAMCommandStructure.FMC_CommandTarget = FMC_Command_Target_bank1;
   FMC_SDRAMCommandStructure.FMC_AutoRefreshNumber = 8;
   FMC_SDRAMCommandStructure.FMC_ModeRegisterDefinition = 0;

   /* Wait until the SDRAM controller is ready */
   timeout = SDRAM_TIMEOUT;
   while((FMC_GetFlagStatus(FMC_Bank1_SDRAM, FMC_FLAG_Busy) != RESET) && (timeout > 0))
   {
      timeout--;
   }
   /* Send the command */
   FMC_SDRAMCmdConfig(&FMC_SDRAMCommandStructure);

   /* Step 7 -----------------------------------------------------------------*/
   /* Program the external memory mode register */
   tmpr = (uint32_t)SDRAM_MODEREG_BURST_LENGTH_1          |
         SDRAM_MODEREG_BURST_TYPE_SEQUENTIAL   |
         SDRAM_MODEREG_CAS_LATENCY_3           |
         SDRAM_MODEREG_OPERATING_MODE_STANDARD |
         SDRAM_MODEREG_WRITEBURST_MODE_SINGLE;

   /* Configure a load Mode register command*/
   FMC_SDRAMCommandStructure.FMC_CommandMode = FMC_Command_Mode_LoadMode;
   FMC_SDRAMCommandStructure.FMC_CommandTarget = FMC_Command_Target_bank1;
   FMC_SDRAMCommandStructure.FMC_AutoRefreshNumber = 1;
   FMC_SDRAMCommandStructure.FMC_ModeRegisterDefinition = tmpr;

   /* Wait until the SDRAM controller is ready */
   timeout = SDRAM_TIMEOUT;
   while((FMC_GetFlagStatus(FMC_Bank1_SDRAM, FMC_FLAG_Busy) != RESET) && (timeout > 0))
   {
      timeout--;
   }
   /* Send the command */
   FMC_SDRAMCmdConfig(&FMC_SDRAMCommandStructure);

   /* Step 8 -----------------------------------------------------------------*/

   /* Set the refresh rate counter */
   /* (15.62 us x Freq) - 20 */
   /* Set the device refresh counter */
   FMC_SetRefreshCount( 1385 );

   /* Wait until the SDRAM controller is ready */
   timeout = SDRAM_TIMEOUT;
   while((FMC_GetFlagStatus(FMC_Bank1_SDRAM, FMC_FLAG_Busy) != RESET) && (timeout > 0))
   {
      timeout--;
   }
}

/******************************************************************************/
void SDRAM_WriteBuffer(
      uint32_t *pBuffer,
      uint32_t uwWriteAddress,
      uint32_t uwBufferSize
)
{
   __IO uint32_t write_pointer = (uint32_t)uwWriteAddress;

   /* Disable write protection */
   FMC_SDRAMWriteProtectionConfig(FMC_Bank1_SDRAM, DISABLE);

   /* Wait until the SDRAM controller is ready */
   while(FMC_GetFlagStatus(FMC_Bank1_SDRAM, FMC_FLAG_Busy) != RESET)
   {
   }

