rost0031/STM32491_CPLR/Firmware/Common/bsp/sdram/sdram.c
   /* While there is data to write */
   for (; uwBufferSize != 0; uwBufferSize--) {
      /* Transfer data to the memory */
      *(uint32_t *) (SDRAM_BANK_ADDR + write_pointer) = *pBuffer++;

      /* Increment the address*/
      write_pointer += 4;
   }
}

/******************************************************************************/
void SDRAM_ReadBuffer(
      uint32_t* pBuffer,
      uint32_t uwReadAddress,
      uint32_t uwBufferSize
)
{
   __IO uint32_t write_pointer = (uint32_t)uwReadAddress;


   /* Wait until the SDRAM controller is ready */
   while(FMC_GetFlagStatus(FMC_Bank1_SDRAM, FMC_FLAG_Busy) != RESET)
   {
   }

   /* Read data */
   for(; uwBufferSize != 0x00; uwBufferSize--) {
      *pBuffer++ = *(__IO uint32_t *)(SDRAM_BANK_ADDR + write_pointer );

      /* Increment the address*/
      write_pointer += 4;
   }
}

/******************************************************************************/
void SDRAM_TestDestructive( void )
{
#define BUFFER_SIZE        ((uint32_t)0x0100)
#define WRITE_READ_ADDR    ((uint32_t)0x0800)

   uint32_t aTxBuffer[BUFFER_SIZE];
   uint32_t aRxBuffer[BUFFER_SIZE];

   uint32_t tmpIndex = 0;
   uint32_t uwOffset = 0x250F;

   /* 1. Fill the buffer to write */
   DBG_printf("Filling buffer...\n");
   for (tmpIndex = 0; tmpIndex < BUFFER_SIZE; tmpIndex++ ) {
      aTxBuffer[tmpIndex] = tmpIndex + uwOffset;
   }

   /* 2. Write buffer to SDRAM */
   DBG_printf("Writing buffer...\n");
   SDRAM_WriteBuffer(aTxBuffer, WRITE_READ_ADDR, BUFFER_SIZE);
   DBG_printf("Write finished\n");

   /* 3. Read data from the SDRAM */
   DBG_printf("Reading buffer...\n");
   SDRAM_ReadBuffer(aRxBuffer, WRITE_READ_ADDR, BUFFER_SIZE);
   DBG_printf("Read finished\n");

   /* 4. Check buffers against each other */
   DBG_printf("Checking buffers...\n");
   uint32_t uwIndex = 0;
   __IO uint32_t uwWriteReadStatus = 0;
   for (uwIndex = 0; (uwIndex < BUFFER_SIZE) && (uwWriteReadStatus == 0); uwIndex++) {
      if (aRxBuffer[uwIndex] != aTxBuffer[uwIndex]) {
         ERR_printf("Written and read back values don't match: wrote 0x%04x and read back 0x%04x\n", aTxBuffer[uwIndex], aRxBuffer[uwIndex] );
         uwWriteReadStatus = uwIndex + 1;
      }
   }
   DBG_printf("Result of buffer check: %d\n", uwWriteReadStatus );

   /* Test a buffer placed directly into SDRAM by the linker */
   for (uint16_t uwIndexLarge = 0; uwIndexLarge < 10000 ; uwIndexLarge++) {
      sdRamTestBuffer[uwIndexLarge] = uwIndexLarge;
   }

  uint32_t uwRamBufferAddr = (uint32_t)sdRamTestBuffer; /* should be 0xC00xxxxx */

  /* Get main stack pointer value */
  uint32_t MSPValue = __get_MSP(); /* should be 0xC00xxxxx */
  uint16_t tmpRamIndex = 5553;
  DBG_printf("Copied data to large SDRAM buffer.  Value at %u is %u\n",tmpRamIndex , sdRamTestBuffer[tmpRamIndex]);
  DBG_printf("Stack pointer addr: 0x%08x, SDRAM buffer addr: 0x%08x\n", MSPValue, uwRamBufferAddr);

}

/******************************************************************************/
uint32_t SDRAM_testDataBus( const uint32_t addr )
{
   LOG_printf("Testing RAM data bus...\n");
   for( uint32_t p = 1; p != 0; p <<= 1 ) {
      *(__IO uint32_t *)(SDRAM_BANK_ADDR + addr) = p; // Write pattern to the address

      if (  *(__IO uint32_t *)(SDRAM_BANK_ADDR + addr ) != p ) {
         ERR_printf(
               "RAM data bus test failed. Expected: 0x%08x, read: 0x%08x\n",
               p,
               *(__IO uint32_t *)(SDRAM_BANK_ADDR + addr )
         );
         return p;
      }
   }

   LOG_printf("RAM data bus test finished with no errors.\n");
   return 0;
}

/******************************************************************************/
uint32_t SDRAM_testAddrBus( const uint32_t addr, const uint32_t nBytes )
{
   LOG_printf("Testing RAM address bus...\n");
   uint32_t addrMask = nBytes/sizeof(uint8_t) - 1;

   uint8_t testPattern = (uint8_t) 0xAA;
   uint8_t antiPattern = (uint8_t) 0x55;

   uint32_t offset = 0;
   /* Write the default pattern to each of the power of two offsets */
   for( offset = 1; (offset & addrMask ) != 0; offset <<= 1 ) {
      *(__IO uint8_t *)(SDRAM_BANK_ADDR + addr + offset) = testPattern;
   }

   /* Check for address bits stuck high */
   uint32_t testOffset = 0;
   *(uint8_t *)(SDRAM_BANK_ADDR + addr + testOffset) = antiPattern;

   LOG_printf("Testing for address lines stuck high...\n");

   for( offset = 1; (offset & addrMask) != 0; offset <<= 1 ) {
      if ( *(__IO uint8_t *)(SDRAM_BANK_ADDR + addr + offset ) != testPattern ) {
         ERR_printf(
               "RAM address bus stuck-high test failed. Expected: 0x%08x, read: 0x%08x\n",
               testPattern,
               *(__IO uint8_t *)(SDRAM_BANK_ADDR + addr + offset )
         );
         SDRAM_slowPrintMemRegion(SDRAM_BANK_ADDR + addr, 128);

         return( SDRAM_BANK_ADDR + addr + offset );
      }
   }

   LOG_printf("Stuck-high test finished with no errors.\n");
   LOG_printf("Testing for address lines stuck low or shorted...\n");

   *(__IO uint8_t *)(SDRAM_BANK_ADDR + addr + testOffset) = testPattern;

   /* Check for address bits stuck low or shorted */
   for( testOffset = 1; (testOffset & addrMask) != 0; testOffset <<= 1 ) {
      *(uint8_t *)(SDRAM_BANK_ADDR + addr + testOffset) = antiPattern;

      if ( *(__IO uint8_t *)(SDRAM_BANK_ADDR + addr + 0) != testPattern ) {
         ERR_printf(
               "RAM address bus stuck-low test failed. Expected: 0x%02x, read: 0x%02x\n",
               testPattern,
               *(__IO uint8_t *)(SDRAM_BANK_ADDR + addr + 0 )
         );
         SDRAM_slowPrintMemRegion(SDRAM_BANK_ADDR + addr, 128);
         return( SDRAM_BANK_ADDR + addr + 0 );
      }

      for( offset = 1; (offset & addrMask) != 0; offset <<= 1 ) {
         if ( offset != testOffset &&
               *(__IO uint8_t *)(SDRAM_BANK_ADDR + addr + offset) != testPattern ) {
            ERR_printf(
                  "RAM address bus stuck-low test failed. Expected: 0x%02x, read: 0x%02x\n",
                  testPattern,
                  *(__IO uint8_t *)(SDRAM_BANK_ADDR + addr + offset )
            );
            SDRAM_slowPrintMemRegion(SDRAM_BANK_ADDR + addr + offset, 128);
            return( SDRAM_BANK_ADDR + addr + testOffset );
         }
      }

      *(__IO uint8_t *)(SDRAM_BANK_ADDR + addr + testOffset) = testPattern;
   }
   LOG_printf("Stuck-low test finished with no errors.\n");
   LOG_printf("RAM address bus test finished with no errors.\n");
   return 0;
}

/******************************************************************************/
uint32_t SDRAM_testDevice( const uint32_t addr, const uint32_t nBytes )
{
   LOG_printf("Testing RAM device...\n");

